Revit 2022 API
AnalyticalSupportChecking Members
The AnalyticalSupportChecking type exposes the following members.
Methods
Name | Description
CheckMemberSupports
 Check if the document contains unsupported Structural Elements.
See Also
AnalyticalSupportChecking Class
Autodesk.Revit.DB.Structure Namespace